In [1]:
import gspread
import pandas

In [2]:
gc = gspread.service_account("bot-telegram-302121-9269276f665c.json")

In [3]:
wks = gc.open_by_key('1W4dxhCViCFgArafr1uuHSsutHIwFGscgwBORJidZ0Qk')

In [8]:
wks = gc.open_by_key('17LChMVFNgyQnAyodf1bHROlyA7x8GSHMV9l8sMhZokk')

In [4]:
wks

In [5]:
worksheet = wks.get_worksheet(0)

In [7]:
dataframe = pandas.DataFrame(worksheet.get_all_values())

In [8]:
dataframe

,0,1,2,3,4
0,Ranking,,,,
1,,,,,
2,Nombre,nick,id,Puntos Acumulados,Programas completados
3,josé ángel,@jabaselga,136839859,1,"1, 2, 6, 8"
4,Stary Dark,@Dark_zly,379473597,7,
5,Ecotracker Uss,@ecotracker,1179536465,96,
6,Daniel Castillo,@dlcastillop,904756673,12,
7,Raúl,@spleyades,543955459,13,
8,Ichigo Kurozaki,@BlackShinigami00,842688072,73,
9,AN0N1MAT0,@SR_4N0N666,186992902,44,
10,True Ornot,@Trueless,521170501,9,

In [9]:
data = worksheet.get_all_values()
del data[0:2]

In [10]:
data

[['Nombre', 'nick', 'id', 'Puntos Acumulados', 'Programas completados'],
 ['josé ángel', '@jabaselga', '136839859', '1', '1, 2, 6, 8'],
 ['Stary Dark', '@Dark_zly', '379473597', '7', ''],
 ['Ecotracker Uss', '@ecotracker', '1179536465', '96', ''],
 ['Daniel Castillo', '@dlcastillop', '904756673', '12', ''],
 ['Raúl', '@spleyades', '543955459', '13', ''],
 ['Ichigo Kurozaki', '@BlackShinigami00', '842688072', '73', ''],
 ['AN0N1MAT0', '@SR_4N0N666', '186992902', '44', ''],
 ['True Ornot', '@Trueless', '521170501', '9', '']]

In [113]:
headers = data.pop(0)

In [114]:

df = pd.DataFrame(data, columns=headers)

In [132]:
df['Puntos Acumulados'] = df['Puntos Acumulados'].astype(int)

In [133]:
df[["Nombre","Puntos Acumulados"]]

            Nombre  Puntos Acumulados
0       josé ángel                  1
1       Stary Dark                  7
2   Ecotracker Uss                 96
3  Daniel Castillo                 12
4             Raúl                 13
5  Ichigo Kurozaki                 73
6        AN0N1MAT0                 44
7       True Ornot                  9

In [135]:
df.sort_values(["Puntos Acumulados"], ascending=False)[["Nombre","Puntos Acumulados"]]

            Nombre  Puntos Acumulados
2   Ecotracker Uss                 96
5  Ichigo Kurozaki                 73
6        AN0N1MAT0                 44
4             Raúl                 13
3  Daniel Castillo                 12
7       True Ornot                  9
1       Stary Dark                  7
0       josé ángel                  1